In [92]:
import pandas as pd

In [93]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
})

df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

#### Get a specific row (Series)

In [94]:
df.loc[0]

Name    Alice
Age        25
Name: 0, dtype: object

#### Get a specific row and columns (Series)

In [95]:
df.loc[1, ['Age', 'Name']]

Age      30
Name    Bob
Name: 1, dtype: object

#### Get a specific row (DataFrame)

In [96]:
df.loc[[0]]

    Name  Age
0  Alice   25

#### Get specific rows (DataFrame)

In [97]:
df.loc[[0, 2]]

      Name  Age
0    Alice   25
2  Charlie   35

#### Get specific rows and columns (DataFrame)

In [98]:
df.loc[[2, 1], ['Age', 'Name']]

   Age     Name
2   35  Charlie
1   30      Bob

#### Get a range of rows and columns (Slicing) (DataFrame)

In [99]:
df.loc[2:1:-1, ['Age', 'Name']]

   Age     Name
2   35  Charlie
1   30      Bob

#### **iloc**

- iloc is the same as loc, but it uses column's index instead of column's label
- iloc is used for integer-based indexing, which means you select data based on integer positions.

In [100]:
# df.loc[0:2, ['Age', 'Name']]
# Equal to..
df.iloc[0:, [1, 0]]

   Age     Name
0   25    Alice
1   30      Bob
2   35  Charlie